; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared2 - mode
	infrared0 - mode
	spectrograph4 - mode
	image3 - mode
	image1 - mode
	thermograph5 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star2 - direction
	Star7 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star5 - direction
	Star8 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph5)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star7)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star9)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 thermograph5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph5)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite2 Phenomenon11)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon11 spectrograph4)
	(have_image Star12 image3)
	(have_image Star12 spectrograph4)
	(have_image Star13 infrared0)
	(have_image Star13 spectrograph4)
	(have_image Star14 infrared0)
	(have_image Star15 infrared2)
	(have_image Star15 thermograph5)
))

)

; plan
1. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 star9)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 star12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star12)
   goals met: 0 of 10
5. (take_image satellite1 star12 instrument2 image3)
   added: (have_image star12 image3)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon11 instrument2 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 2 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 10
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 10
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 10
12. (turn_to satellite0 star13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star13)
   goals met: 2 of 10
13. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 3 of 10
14. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 3 of 10
15. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 4 of 10
16. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 4 of 10
17. (take_image satellite0 star15 instrument0 infrared2)
   added: (have_image star15 infrared2)
   goals met: 5 of 10
18. (take_image satellite0 star15 instrument0 thermograph5)
   added: (have_image star15 thermograph5)
   goals met: 6 of 10
19. (turn_to satellite1 groundstation10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation10)
   goals met: 6 of 10
20. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 6 of 10
21. (turn_to satellite1 phenomenon11 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 10
22. (take_image satellite1 phenomenon11 instrument1 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 7 of 10
23. (turn_to satellite1 star12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star12)
   goals met: 7 of 10
24. (take_image satellite1 star12 instrument1 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 8 of 10
25. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 8 of 10
26. (take_image satellite1 star13 instrument1 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 9 of 10
27. (turn_to satellite2 phenomenon11 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon11)
   goals met: 10 of 10
